![Transactions](img/lake.PNG)

In [9]:
%%sql
create table estados
select _c0 `Nome`
     , _c1 `Acronimo`
  from csv.`workspace://churn/data/estados.csv.gz`

Empty DataFrame
Columns: []
Index: []

# Original Data

Mobile operators have historical records on which customers ultimately ended up churning and which continued using the service. We can use this historical information to construct an ML model of one mobile operator’s churn using a process called training. After training the model, we can pass the profile information of an arbitrary customer (the same profile information that we used to train the model) to the model, and have the model predict whether this customer is going to churn. Of course, we expect the model to make mistakes–after all, predicting the future is tricky business! But I’ll also show how to deal with prediction errors.

```sh
wget http://dataminingconsultant.com/DKD2e_data_sets.zip
unzip -o DKD2e_data_sets.zip
```

In [1]:
import pandas as pd
pd.options.display.max_rows = 999
pd.options.display.max_columns = 999
spark.read.format('csv').options(header='true', inferSchema='true').load('data/churn.txt').show()

+-----+--------------+---------+--------+----------+----------+-------------+--------+---------+----------+--------+---------+----------+----------+-----------+------------+---------+----------+-----------+--------------+------+
|State|Account Length|Area Code|   Phone|Int'l Plan|VMail Plan|VMail Message|Day Mins|Day Calls|Day Charge|Eve Mins|Eve Calls|Eve Charge|Night Mins|Night Calls|Night Charge|Intl Mins|Intl Calls|Intl Charge|CustServ Calls|Churn?|
+-----+--------------+---------+--------+----------+----------+-------------+--------+---------+----------+--------+---------+----------+----------+-----------+------------+---------+----------+-----------+--------------+------+
|   KS|           128|      415|382-4657|        no|       yes|           25|   265.1|      110|     45.07|   197.4|       99|     16.78|     244.7|         91|       11.01|     10.0|         3|        2.7|             1|False.|
|   OH|           107|      415|371-7191|        no|       yes|           26|   161.6|      123|     27.47|   195.5|      103|     16.62|     254.4|        103|       11.45|     13.7|         3|        3.7|             1|False.|
|   NJ|           137|      415|358-1921|        no|        no|            0|   243.4|      114|     41.38|   121.2|      110|      10.3|     162.6|        104|        7.32|     12.2|         5|       3.29|             0|False.|
|   OH|            84|      408|375-9999|       yes|        no|            0|   299.4|       71|      50.9|    61.9|       88|      5.26|     196.9|         89|        8.86|      6.6|         7|       1.78|             2|False.|
|   OK|            75|      415|330-6626|       yes|        no|            0|   166.7|      113|     28.34|   148.3|      122|     12.61|     186.9|        121|        8.41|     10.1|         3|       2.73|             3|False.|
|   AL|           118|      510|391-8027|       yes|        no|            0|   223.4|       98|     37.98|   220.6|      101|     18.75|     203.9|        118|        9.18|      6.3|         6|        1.7|             0|False.|
|   MA|           121|      510|355-9993|        no|       yes|           24|   218.2|       88|     37.09|   348.5|      108|     29.62|     212.6|        118|        9.57|      7.5|         7|       2.03|             3|False.|
|   MO|           147|      415|329-9001|       yes|        no|            0|   157.0|       79|     26.69|   103.1|       94|      8.76|     211.8|         96|        9.53|      7.1|         6|       1.92|             0|False.|
|   LA|           117|      408|335-4719|        no|        no|            0|   184.5|       97|     31.37|   351.6|       80|     29.89|     215.8|         90|        9.71|      8.7|         4|       2.35|             1|False.|
|   WV|           141|      415|330-8173|       yes|       yes|           37|   258.6|       84|     43.96|   222.0|      111|     18.87|     326.4|         97|       14.69|     11.2|         5|       3.02|             0|False.|
|   IN|            65|      415|329-6603|        no|        no|            0|   129.1|      137|     21.95|   228.5|       83|     19.42|     208.8|        111|         9.4|     12.7|         6|       3.43|             4| True.|
|   RI|            74|      415|344-9403|        no|        no|            0|   187.7|      127|     31.91|   163.4|      148|     13.89|     196.0|         94|        8.82|      9.1|         5|       2.46|             0|False.|
|   IA|           168|      408|363-1107|        no|        no|            0|   128.8|       96|      21.9|   104.9|       71|      8.92|     141.1|        128|        6.35|     11.2|         2|       3.02|             1|False.|
|   MT|            95|      510|394-8006|        no|        no|            0|   156.6|       88|     26.62|   247.6|       75|     21.05|     192.3|        115|        8.65|     12.3|         5|       3.32|             3|False.|
|   IA|            62|      415|366-9238|        no|        no|            0|   120.7|       70|     20.52|   307.2|       76|     26.11|     203.0|         99|        9.14|     13.1|         6|       3.54|             4|False.|
|   NY|           161|      415|351-7269|        no|        no|            0|   332.9|       67|     56.59|   317.8|       97|     27.01|     160.6|        128|        7.23|      5.4|         9|       1.46|             4| True.|
|   ID|            85|      408|350-8884|        no|       yes|           27|   196.4|      139|     33.39|   280.9|       90|     23.88|      89.3|         75|        4.02|     13.8|         4|       3.73|             1|False.|
|   VT|            93|      510|386-2923|        no|        no|            0|   190.7|      114|     32.42|   218.2|      111|     18.55|     129.6|        121|        5.83|      8.1|         3|       2.19|             3|False.|
|   VA|            76|      510|356-2992|        no|       yes|           33|   189.7|       66|     32.25|   212.8|       65|     18.09|     165.7|        108|        7.46|     10.0|         5|        2.7|             1|False.|
|   TX|            73|      415|373-2782|        no|        no|            0|   224.4|       90|     38.15|   159.5|       88|     13.56|     192.8|         74|        8.68|     13.0|         2|       3.51|             1|False.|
+-----+--------------+---------+--------+----------+----------+-------------+--------+---------+----------+--------+---------+----------+----------+-----------+------------+---------+----------+-----------+--------------+------+
only showing top 20 rows

# Fontes de dados

+ [ORACLE1](https://console.aws.amazon.com/rds): Oracle 12c
+ [FIN_BR](https://console.aws.amazon.com/rds): MySQL 8

![Transactions](img/transactions_erd.PNG)

In [10]:
%%sql -v
SELECT * 
  FROM ORACLE1.OT.TRANSACTION_TYPES

WARNING:ORACLE1.OT.TRANSACTION_TYPES is outdated: 2020-03-15 (7 days)
INFO:Execution Time: 105.829305

                     id   description
0  2.000000000000000000      Educação
1  3.000000000000000000    Transporte
2  5.000000000000000000         Lazer
3  6.000000000000000000  Supermercado
4  1.000000000000000000      Serviços
5  4.000000000000000000   Restaurante
6  7.000000000000000000        Outros

[![consulta](img/import.PNG)](https://console.aws.amazon.com/states/home?region=us-east-1#/executions/details/arn:aws:states:us-east-1:229343956935:execution:DoraImportMachine:20200415100645351937.ORACLE1.OT.TRANSACTION_TYPES)

In [11]:
%%sql -v
SELECT t.USER_ID 
     , t.TRANSACTION_DATE 
     , t.TRANSACTION_TYPE 
     , t.VALUE 
     , tt.DESCRIPTION 
  FROM ORACLE1.OT.TRANSACTIONS t
  JOIN ORACLE1.OT.TRANSACTION_TYPES tt ON t.CATEGORY_ID = tt.ID 
 ORDER BY t.USER_ID
 LIMIT 10

WARNING:ORACLE1.OT.TRANSACTIONS is outdated: 2020-03-15 (7 days)
INFO:ORACLE1.OT.TRANSACTION_TYPES is updated: 2020-04-15 (7 days)
INFO:Execution Time: 41.719065

,USER_ID,TRANSACTION_DATE,TRANSACTION_TYPE,VALUE,DESCRIPTION
0,1.000000000000000000,2020-03-04 19:20:22,DEBITO,253.0800000000,Outros
1,1.000000000000000000,2020-03-29 21:51:10,CREDITO,413.1600000000,Educação
2,1.000000000000000000,2020-03-10 05:51:52,DEBITO,570.5300000000,Outros
3,1.000000000000000000,2020-03-30 02:05:05,DEBITO,721.3500000000,Serviços
4,1.000000000000000000,2020-03-25 06:48:34,CREDITO,287.6800000000,Outros
5,22.000000000000000000,2020-03-20 10:52:58,CREDITO,62.7600000000,Outros
6,23.000000000000000000,2020-03-01 13:34:02,CREDITO,280.2600000000,Serviços
7,23.000000000000000000,2020-03-23 01:28:24,CREDITO,773.8600000000,Transporte
8,23.000000000000000000,2020-03-14 12:38:09,CREDITO,258.4300000000,Educação
9,23.000000000000000000,2020-03-12 16:22:23,CREDITO,38.0300000000,Transporte

In [12]:
%%sql
CREATE OR REPLACE VIEW CATEGORIES AS
SELECT t.USER_ID `USER_ID`
     , ts.total `T_SERVICOS`
     , td.total `T_EDUCACAO`
     , tr.total `T_RESTAURANTE`
     , tt.total `T_TRANSPORTE`
     , tl.total `T_LAZER`
     , tm.total `T_SUPERMERCADO`
     , to.total `T_OUTROS`
  FROM (
SELECT distinct(USER_ID) `USER_ID`
  FROM ORACLE1.OT.TRANSACTIONS) t
  LEFT OUTER JOIN (
SELECT USER_ID
     , SUM(VALUE) `TOTAL`
  FROM ORACLE1.OT.TRANSACTIONS
 WHERE CATEGORY_ID = 1
 GROUP BY USER_ID) ts ON ts.USER_ID = t.USER_ID
  LEFT OUTER JOIN (
SELECT USER_ID
     , SUM(VALUE) `TOTAL`
  FROM ORACLE1.OT.TRANSACTIONS
 WHERE CATEGORY_ID = 2
 GROUP BY USER_ID) td ON td.USER_ID = t.USER_ID
  LEFT OUTER JOIN (
SELECT USER_ID
     , SUM(VALUE) `TOTAL`
  FROM ORACLE1.OT.TRANSACTIONS
 WHERE CATEGORY_ID = 3
 GROUP BY USER_ID) tr ON tr.USER_ID = t.USER_ID
  LEFT OUTER JOIN (
SELECT USER_ID
     , SUM(VALUE) `TOTAL`
  FROM ORACLE1.OT.TRANSACTIONS
 WHERE CATEGORY_ID = 4
 GROUP BY USER_ID) tt ON tt.USER_ID = t.USER_ID
  LEFT OUTER JOIN (
SELECT USER_ID
     , SUM(VALUE) `TOTAL`
  FROM ORACLE1.OT.TRANSACTIONS
 WHERE CATEGORY_ID = 5
 GROUP BY USER_ID) tl ON tl.USER_ID = t.USER_ID
  LEFT OUTER JOIN (
SELECT USER_ID
     , SUM(VALUE) `TOTAL`
  FROM ORACLE1.OT.TRANSACTIONS
 WHERE CATEGORY_ID = 6
 GROUP BY USER_ID) tm ON tm.USER_ID = t.USER_ID
  LEFT OUTER JOIN (
SELECT USER_ID
     , SUM(VALUE) `TOTAL`
  FROM ORACLE1.OT.TRANSACTIONS
 WHERE CATEGORY_ID = 7
 GROUP BY USER_ID) to ON to.USER_ID = t.USER_ID

Empty DataFrame
Columns: []
Index: []

In [ ]:
%%sql
SELECT * 
  FROM CATEGORIES 
 LIMIT 10

![Transactions](img/users_erd.PNG)

In [ ]:
%%sql
select * from fin_br.fin.ADDRESS limit 2

In [ ]:
%%sql
select * from csv.`workspace://churn/data/estados.csv.gz`

In [ ]:
%%sql
SELECT *
 FROM fin_br.fin.ADDRESS a
  JOIN csv.`workspace://churn/data/estados.csv.gz` e ON upper(e._c0) = upper(a.state)
LIMIT 10

In [ ]:
%%sql
CREATE TABLE CHURN AS
SELECT a.postcode `CEP`
     , e._c1 `ESTADO`
     , u.gender `GENERO`
     , substring(u.cell,2,2) `DDD`
     , substring(replace(u.cell,'-',''),6) `CELULAR`
     , datediff(now(), u.dob)/365 `IDADE`
     , datediff(now(), l.registered)/365 `IDADE_CONTA`
     , cast(nvl(c.total, 0) as float) `CREDITO`
     , cast(nvl(d.total, 0) as float) `DEBITO`
     , cast(nvl(cat.T_SERVICOS, 0) AS float) `T_SERVICOS`
     , cast(nvl(cat.T_EDUCACAO, 0) AS float) `T_EDUCACAO`
     , cast(nvl(cat.T_RESTAURANTE, 0) AS float) `T_RESTAURANTE`
     , cast(nvl(cat.T_TRANSPORTE, 0) AS float) `T_TRANSPORTE`
     , cast(nvl(cat.T_LAZER, 0) AS float) `T_LAZER`
     , cast(nvl(cat.T_SUPERMERCADO, 0) AS float) `T_SUPERMERCADO`
     , cast(nvl(cat.T_OUTROS, 0) AS float) `T_OUTROS`
     , if(l.inactivate_date is null, 'False.', 'True.') `CHURN`
  FROM fin_br.fin.LOGIN l 
  JOIN fin_br.fin.USERS u ON l.UUID = u.UUID 
  JOIN fin_br.fin.ADDRESS a ON a.UUID = u.UUID 
  JOIN csv.`workspace://churn/data/estados.csv.gz` e ON upper(e._c0) = upper(a.state)
  LEFT OUTER JOIN (
SELECT t.USER_ID
     , SUM(t.VALUE) `TOTAL`
  FROM ORACLE1.OT.TRANSACTIONS t
 WHERE t.TRANSACTION_TYPE = 'CREDITO'
 GROUP BY t.USER_ID) c ON c.USER_ID = l.UUID
  LEFT OUTER JOIN (
SELECT t.USER_ID
     , SUM(t.VALUE) `TOTAL`
  FROM ORACLE1.OT.TRANSACTIONS t
 WHERE t.TRANSACTION_TYPE = 'DEBITO'
 GROUP BY t.USER_ID) d ON d.USER_ID = l.UUID
  LEFT OUTER JOIN CATEGORIES cat ON cat.USER_ID = l.UUID

In [13]:
%%sql
show tables

      database   tableName  isTemporary
0  dora_didone  categories        False
1  dora_didone       churn        False
2  dora_didone     estados        False
3  dora_didone  t_servicos        False

In [ ]:
%%sql
select * from CHURN limit 10